# Makefile - выступает и как документация, и как код
# Держит короткие имена для длинных команд

# .PHONY указывает, что имена ниже - просто названия команд,
# а не реальные файлы или папки на диске, защищает от багов
.PHONY: install lint format test up down

# Команда для первичной настройки проекта (`make install`)
install:
	uv sync # Установка всех зависимостей проекта
	uv run pre-commit install # Регистрирует pre-commit хуки в Git

# Команда для проверки качества кода (без изменений, `make lint`)
lint:
	uv run ruff check . # Проверка линтером Ruff (наличие ошибок и неиспользованного кода)
	uv run ruff format --check # Проверка форматирования кода
	uv run mypy # Запуск строгого статического анализатора типов


# Команда для автоматического исправления стиля кода (`make format`)
format:
	uv run ruff check --fix # Запуск Ruff и автоисправление
	uv run ruff format . # Автоформатирование всех файлов (отступы, кавычки, длины строк)

# Команда для запуска автотестов (`make test`)
test:
	uv run pytest # Прогон тестов pytest

# Команда для запуска инфры проекта (`make up`)
up:
	docker compose up -d # Запуск контейнеров Docker в фоновом режиме (без -d захватывал бы терминал)

# Команда остановки инфры (`make down`)
down:
	docker compose down # Останавливает и удаляет запущенные контейнеры, освобождает ресурсы
